app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries"
---
    def index
        render json: Entry.all

INSERT INTO "entries" ("user_id", "title", "comment", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        entry = @current_user.entries.create!(entry_params)

SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ? AND "entries"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 1]]
---
    def destroy
        entry = @current_user.entries.find_by(id: params[:id])
        if entry
        entry.destroy

SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ? AND "entries"."id" = ? LIMIT ?  [["user_id", 2], ["id", 3], ["LIMIT", 1]]
UPDATE "entries" SET "rating" = ?, "updated_at" = ? WHERE "entries"."id" = ?  [["rating", 8], ["updated_at", "2021-10-06 22:37:09.103815"], ["id", 6]]
---
    def update
        entry = @current_user.entries.find_by(id: params[:id])
        if entry
            entry.update(entry_params)