app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "image_url", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        user = User.create!(user_params)